import "../../styles/about.css";
import coachImg from "../../styles/assets/maria-avatar.png"; 

const About = () => {
  return (
    <div className="about-container">
      <h1 className="main-title">О НАС</h1>
      <div className="about-content">
        <div className="about-text">
          <p>
            Школа плавания <strong>MARIASWIMPRO</strong> основана в 2020 году группой
            бывших профессиональных спортсменов и дипломированных тренеров.
            Мы обучаем как детей, так и взрослых — от новичков до продвинутых пловцов.
          </p>
          <p>
            Наши тренеры имеют большой опыт работы, индивидуально подходят к каждому
            ученику и помогают достигать максимальных результатов.
          </p>
          <ul>4 уровня подготовки:  
            <li>1. Начальный уровень подготовки</li>
            <li>2. Продолжающий уровень - повторение и закрепление навыков и умений</li>
            <li>3. Совершенствование стилей плавания</li>
            <li>4. Профи - профессиональная подготовка к участию в соревнованиях и сдачи разрядов</li>
          </ul>
          <p>Для каждого уровня подготовки -своя адаптированная программа обучения</p>
          <p>Наша команда – профессиональные тренеры с педагогическим образованием и большим стажем работы , со спортивными разрядами.  </p>
          <p>Мы специалисты в области:</p>
            <ul>
                <li>- обучение плаванию детей любого возраста</li>
                <li>- грудничковое плавание</li>
                <li>- раннее плавание</li>
                <li>- в работе с детьми с ограниченными возможностями </li>
                <li>- профессионально-техническая подготовка юных спортсменов и триатлетов</li>
                <li>- работа с пожилыми людьми</li>
                <li>- реабилитация после травм , ЛФК</li>
            </ul>
            <p>Для каждой группы – индивидуальные программы. Мы не просто учим плавать, а воспитываем здоровых и уверенных в воде людей.</p>
        </div>
        <div className="about-image">
          <img src={coachImg} alt="Наш тренер" />
        </div>
      </div>
    </div>
  );
};

export default About;
