import "../../styles/about.css";
import coachImg from "../../styles/assets/maria-avatar.png"; 

const About = () => {
  return (
    <div className="about-container">
      <h1 className="main-title">О НАС</h1>
      <div className="about-content">
        <div className="about-text">
          <p>
            Школа плавания <strong>MARIASWIMPRO</strong> основана в 2020 году группой
            бывших профессиональных спортсменов и дипломированных тренеров.
            Мы обучаем как детей, так и взрослых — от новичков до продвинутых пловцов.
          </p>
          <p>
            Наши тренеры имеют большой опыт работы, индивидуально подходят к каждому
            ученику и помогают достигать максимальных результатов.
          </p>
          <ul>4 уровня подготовки:  
            <li>1. Обучение детей с 4 лет</li>
            <li>2. Индивидуальные и групповые занятия</li>
            <li>3. Подготовка к соревнованиям</li>
            <li>4. Современная методика обучения</li>
          </ul>
          <p>Наша команда – профессиональные тренеры с педагогическим стажем, включая чемпионов, КМС и специалистов по:  </p>
            <ul>
                <li>- грудничковому плаванию,</li>
                <li>- работе с детьми с особенностями (аутизм, ДЦП),</li>
                <li>- обучению взрослых и преодолению страха воды,</li>
                <li>- подготовке триатлетов и пожилых людей.</li>
            </ul>
            <p>Для каждой группы – индивидуальные программы. Мы не просто учим плавать, а воспитываем здоровых и уверенных в воде людей.</p>
        </div>
        <div className="about-image">
          <img src={coachImg} alt="Наш тренер" />
        </div>
      </div>
    </div>
  );
};

export default About;
