import React from 'react';
import '../../styles/legal.css'
const Agreement = () => {
  return (
    <div className="legal-page">
      <div className="legal-container">
        <h1>Договор публичной оферты оказания услуг по проведению занятий по плаванию</h1>
        
        {/* <div className="legal-header">
          <table>
            <tbody>
              <tr>
                <td className='left'><strong>Номер</strong></td>
                <td>[ ]</td>
              </tr>
              <tr>
                <td className='left'><strong>Дата составления</strong></td>
                <td>[ ]</td>
              </tr>
            </tbody>
          </table>
        </div> */}

        <div className="legal-content">
          <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
          <p><strong>1.1.</strong> Данный документ является официальным предложением на заключение договора возмездного оказания услуг (публичной офертой) с Беляевой Марией Геннадьевной, зарегистрированной в качестве самозанятого, ИНН 165702626938, именуемой в дальнейшем "Исполнитель", и содержит все существенные условия предоставления Услуг любому физическому лицу, именуемому в дальнейшем "Заказчик".</p>
          
          <p><strong>1.2.</strong> Настоящая оферта размещена на сайте <a href="https://www.mariaswimpro.ru">https://www.mariaswimpro.ru</a> в открытом доступе, адресована физическим лицам, заключить с Беляевой Марией Геннадьевной, зарегистрированной в качестве самозанятого, ИНН 165702626938, договор на нижеследующих условиях.</p>
          
          <p><strong>1.3.</strong> Акцептом (принятием) условий, изложенных в настоящей публичной Оферте, является запись Заказчика на тренировки/занятия по плаванию, в том числе групповые, индивидуальные/персональные тренировки/занятия по плаванию, пробные тренировки/занятия, а также оставление заявки на сайте на приобретение абонемента на групповые, индивидуальные/персональные занятия по плаванию, либо на пробную тренировку/занятие. Также полным и безоговорочным принятием (акцептом) условий настоящей оферты является осуществление платежа в размере 100% предоплаты стоимости Услуги и поступление на расчётный счёт Исполнителя соответствующих денежных средств.</p>
          
          <p>В соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению договора в письменной форме на условиях, изложенных в оферте.</p>

          <p><strong>1.4.</strong> Договор между Заказчиком и Исполнителем в отношении выбранной Заказчиком на сайте Услуги считается заключённым на условиях Оферты с момента Акцепта и до полного исполнения Исполнителем и Заказчиком своих обязательств по нему.</p>

          <p><strong>1.5.</strong> Правила и порядок обработки персональных данных пользователей сайта и заказчиков изложены в политике конфиденциальности, опубликованной на сайте <a href="https://www.mariaswimpro.ru">https://www.mariaswimpro.ru</a> Предоставление персональных данных означает полное и безоговорочное согласие со всеми пунктами, изложенными в политике.</p>

          <p><strong>1.6.</strong> Совершая действия по акцепту оферта, Заказчик дает согласие на получение рекламной рассылки на адрес электронной почты, указанный им при регистрации на Сайте Исполнителя.</p>
          <p>Одновременно Заказчик подтверждает, что указанный им при регистрации на Сайте адрес электронной почты принадлежит именно ему и третьи лица не имеют к нему доступ.</p>

          <p><strong>1.7.</strong> Совершая действия по акцепту оферта, Заказчик подтверждает, что:</p>
          <ul>
            <li>ознакомился и согласен со всеми условиями оферты и Приложениями к нему;</li>
            <li>ознакомился и согласен со всеми условиями и правилами приема платежей платежных систем, посредством которых можно оплатить Услуги по оферте.</li>
          </ul>

          <h2>2. ПРЕДМЕТ ОФЕРТЫ</h2>
          <p><strong>2.1.</strong> Исполнитель обязуется оказать Заказчику, услуги - тренировки/занятия по плаванию, в том числе групповые, индивидуальные/персональные тренировки/занятия по плаванию, пробные тренировки/занятия, а также согласовать с Пользователем приобретение абонемента на вышеуказанные занятия.</p>
          <p>Услуги могут быть приобретены Заказчиком для его несовершеннолетнего ребенка, в интересах которого он действует при заключении настоящего договора.</p>

          <p><strong>2.2.</strong> Сроки оказания Услуги определены в выбранном заказчиком абонементе. Услуги оказываются по месту оказания Услуг, указанному в абонементе: на базе плавательного бассейна Дворца водных видов спорта (далее ДВВС), расположенного по адресу: Республика Татарстан, город Казань, ул. Сибгата Хакима, дом 70, на базе фитнес-клуба A-fitness, расположенного по адресу: Республика Татарстан, г. Казань, ул.Ибрагимова, дом 54, «Желанные дети», расположенного по адресу: Республика Татарстан, г. Казань, ул.Горсоветская,10, Муниципальное бюджетное общеобразовательное учреждение «Лицей №177» Ново-Савиновского района г. Казани, расположенного по адресу: г. Казань, ул. Мусина, дом 17; на базе плавательного бассейна «Адмиралтейский», расположенного по адресу: г. Казань, ул. 1 мая, дом 5.</p>

          <p><strong>2.3.</strong> Исполнитель оказывает Услуги в соответствии с выбранными и оплаченными Заказчиком, а также на основании цен, опубликованных на Сайте <a href="https://www.mariaswimpro.ru">https://www.mariaswimpro.ru</a></p>

          <p><strong>2.4.</strong> Заказчик производит оплату и получает в соответствии с выбранным Пакетом оказываемые Исполнителем Услуги в соответствии с условиями оферты.</p>

          <p><strong>2.5.</strong> Услуги могут быть оказаны Исполнителем как лично, так и с привлечением третьих лиц. Необходимость привлечения третьих лиц и их кандидатуры определяются Исполнителем по собственному усмотрению.</p>

          <p><strong>2.6.</strong> Если иное не указано в описании Услуги на Сайте, то все Услуги оказываются одновременно нескольким Заказчикам. Заказчик понимает это и соглашается с этим условием.</p>

          <p><strong>2.7.</strong> Для получения Услуги может потребоваться регистрация в иных онлайн-сервисах, о чем Заказчик информируется Исполнителем дополнительно.</p>

          <p><strong>2.8.</strong> Срок и дата начала оказания Услуги определяется Исполнителем в одностороннем порядке и согласовываются дополнительного с Заказчиком. Дата начала оказания Услуги и время также может быть указана в электронном письме, направленном Исполнителем Заказчику, либо посредством СМС-сообщения, Мессенджеров.</p>

          <p><strong>2.9.</strong> Оказываемые по оферте Услуги не являются образовательными услугами. На отношения, вытекающие из оферты, не распространяется действие Федерального закона от 29.12.2012 №273-ФЗ "Об образовании в Российской Федерации" и других нормативно-правовых актов, регулирующих отношения в сфере образования. Заказчик понимает и соглашается с этим.</p>

          <h2>3. ПОРЯДОК ОПЛАТЫ</h2>
          <p><strong>3.1.</strong> Оплата Услуги по оферте осуществляется на основе 100% оплаты (если иное не согласовано с Заказчиком в индивидуальном порядке) и в порядке, установленном офертой.</p>
          <p>Заказчик считается исполнившим обязанность по оплате Услуги с момента поступления денежных средств на расчетный счет Исполнителя.</p>

          <p><strong>3.2.</strong> Оплата Услуги может осуществляться:</p>
          <ul>
            <li>путем безналичного перечисления денежных средств на расчетный счет Исполнителя, указанный в оферте;</li>
            <li>путем использования платежного сервиса предоставленного на Сайте Исполнителя;</li>
            <li>путем передачи наличных денежных средств в день начала оказания услуг, о чем стороны составляют расписку.</li>
          </ul>

          <p><strong>3.3.</strong> Стоимость Услуги Исполнителя, подлежащих оплате Заказчиком, определяется в соответствии с перечнем цен, приведенным на Сайте Исполнителя.</p>

          <p><strong>3.4.</strong> Заказчик самостоятельно оплачивает услуги банков и систем электронных платежей, связанные с перечислением денежных средств на счет Исполнителя, и несет ответственность за правильность производимых им платежей</p>

          <p><strong>3.5.</strong> Все расчеты по оферте производятся в рублях РФ.</p>

          <p><strong>3.6.</strong> В случае невыполнения Заказчиком обязательств по оплате Услуги в соответствии с условиями оферты, Исполнитель вправе приостановить исполнение своих обязательств до момента получения денежных средств от Заказчика либо отказаться от исполнения обязательств по оферте в одностороннем внесудебном порядке.</p>

          <p><strong>3.7.</strong> В случае невозможность Заказчиком присутствовать в согласованное время для получения Услуги по любым причинам либо иной невозможности потребления Услуги, возникшей по причине, которая не зависит от Исполнителя, денежные средства, уплаченные Заказчиком по оферте, возврату не подлежат.</p>

          <h2>4. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>
          
          <h3>4.1. Исполнитель обязан:</h3>
          <ol>
            <li>Оказывать услуги в сроки, определенные настоящим Договором и установленного качества.</li>
            <li>Предоставить инструкторский состав и обслуживающий персонал для оказания услуг и проведения занятий по плаванию, а также необходимые технические средства для обучения и практических занятий.</li>
            <li>Компенсировать занятия, пропущенные по вине Исполнителя, путем проведения дополнительных занятий в согласованное с Заказчиком время.</li>
            <li>Обеспечить чистоту помещений в месте оказания услуг.</li>
            <li>Организовать доступ в помещение раздевалок и душевые.</li>
            <li>Предоставить Заказчику требуемую информацию, непосредственно связанную с вопросами объемов и качества оказываемых услуг.</li>
            <li>Незамедлительно предупредить заказчика о наступлении неблагоприятных последствий в случае невыполнения его указаний, а также при наступлений иных, не зависящих от воли Исполнителя обстоятельств, которые грозят качеству оказываемой услуги либо создают невозможность ее завершения в установленный договором срок.</li>
            <li>В случае пропуска срока по болезни и наличия заверенной справки от лечащего врача на бланке поликлиники с 3 (тремя) печатями, Исполнитель обязан провести заказчику пропущенную тренировку. При этом, Исполнитель обязан согласовать с Заказчиком любым удобным средством связи (Вотсап, СМС, Телеграм) каким-образом будет отработана пропущенная тренировка.</li>
            <li>Извещать о графике работ Заказчика, любых изменениях, касающихся графика любым возможным средством связи (Вотсап, СМС, Телеграм).</li>
          </ol>

          <h3>4.2. Исполнитель имеет право:</h3>
          <p><strong>4.2.1.</strong> Требовать оплаты услуг в порядке и сроки, предусмотренные настоящим Договором.</p>
          <p><strong>4.2.2.</strong> Требовать соблюдения Условий и правил настоящего договора, соблюдения правил поведения в бассейне и на воде.</p>
          <p><strong>4.2.3.</strong> Отказать в предоставлении Заказчику услуг за грубое нарушение правил посещения бассейна.</p>
          <p><strong>4.2.4.</strong> В случае необходимости (при проведении профилактических мер) изменять График оказания услуг, предварительно уведомив об этом Заказчика за 3 ( три) рабочих дня. При этом Исполнитель выделяет для Заказчика другое время.</p>
          <p><strong>4.2.5.</strong> Приостановить исполнение своих обязательств по настоящему Договору при неисполнении Заказчиком условий п. 3.2 настоящего Договор.</p>
          <p><strong>4.2.6.</strong> Переносить занятия на другой день в связи с официальными переносами выходных дней по решению государственных органов либо по техническим причинам.</p>

          <h3>4.3. Заказчик обязан:</h3>
          <p><strong>4.3.1.</strong> Предоставить при необходимости медицинскую справку подтверждающую отсутствие противопоказаний для занятий по плаванию, а так же предоставить справку о результатах паразитологического обследования на энтеробиоз (для ребенка дошкольного и младшего школьного возраст до начала оказания услуги).</p>
          <p><strong>4.3.2.</strong> Соблюдать Правила поведения посетителей плавательного бассейна Исполнителя.</p>
          <p>Несовершеннолетние дети обязаны: подчиняться требованиям администратора и тренера, приходить согласно расписания, верхнюю одежду и обувь снимать при входе.</p>
          <p><strong>4.3.3.</strong> Обеспечить регулярное посещение занятий Заказчиком, либо его несовершеннолетним ребенком.</p>
          <p><strong>4.3.4.</strong> Не допускать порчи и уничтожения оборудования/инвентаря/имущества, а также сетей электро- тепло и водоснабжения, оконных блоков и двери, стеновых покрытий, пола, со стороны Посетителя, а в случае его повреждения возместить причинённый ущерб.</p>
          <p><strong>4.3.5.</strong> В случае пропуска тренировки по уважительной причине -- по болезни, предоставить в разумный срок Исполнителю справку от лечащего врача на бланке поликлиники с 3 (тремя) печатями.</p>
          <p><strong>4.3.6.</strong> Известить Исполнителю любым возможным средством связи (Вотсап, СМС, Телеграм) не менее чем за 1 (один) час о невозможности посещения тренировки.</p>
          <p><strong>4.3.7.</strong> Дать письменное согласие на обработку персональных данных.</p>
          <p><strong>4.3.8.</strong> Дать согласие на фото и видео съемку несовершеннолетнего ребенка.</p>
          <p><strong>4.3.9.</strong> Возместить вред, причиненный имуществу Исполнителя (в том числе имущества третьих лиц, находящегося у Исполнителя в пользовании), а также иные убытки, которые возникли по вине несовершеннолетнего ребенка в результате его действий/бездействий.</p>

          <h3>4.4. Права Заказчика:</h3>
          <p><strong>4.4.1.</strong> Обращаться к Исполнителю по вопросам, связанным с оказанием услуг и использованием технических средств обучения.</p>
          <p><strong>4.4.2.</strong> Требовать оказания Исполнителем услуг, предусмотренных настоящим Договором.</p>

          <h2>5. ПОРЯДОК УРЕГУЛИРОВАНИЯ СПОРОВ</h2>
          <p><strong>5.1.</strong> Претензии Заказчика по оказываемым Услугам принимаются Исполнителем к рассмотрению только в случае, если они направлены в письменном виде на электронный адрес: mariaswimpro@gmail.com.</p>
          <p><strong>5.2.</strong> Сторона, получившая претензию, обязана дать на нее ответ в течение десяти календарных дней со дня получения.</p>
          <p><strong>5.3.</strong> Направленные Исполнителю претензии рассматриваются в рамках действующего законодательства Российской Федерации.</p>
          <p><strong>5.4.</strong> Досудебный претензионный порядок урегулирования спора является обязательным для Сторон.</p>
          <p><strong>5.5.</strong> При не достижении соглашения спор передается на рассмотрение в суд общей юрисдикции в соответствии с действующим законодательством РФ.</p>

          <h2>6. ИЗМЕНЕНИЕ, РАСТОРЖЕНИЕ ОФЕРТЫ</h2>
          <p><strong>6.1.</strong> Исполнитель оставляет за собой право изменять или дополнять любые из условий оферты в любое время, опубликовывая все изменения на Сайте. Если опубликованные изменения для Заказчика неприемлемы, то он в течение 3 календарных дней с момента опубликования изменений должен уведомить об этом Исполнителя письменно. Если уведомления не поступило, то считается, что Заказчик продолжает принимать участие в договорных отношениях на новых условиях.</p>

          <p><strong>6.2.</strong> Стороны вправе расторгнуть оферту по взаимному согласию в любой момент до момента его фактического исполнения.</p>

          <p><strong>6.3.</strong> Стороны пришли к соглашению и установили следующие условия и порядок досрочного расторжения оферты при одностороннем отказе Заказчиком от его исполнения.</p>
          <p>В случае, если Заказчик желает расторгнуть оферту, он обязан:</p>

          <p><strong>6.3.1.</strong> направить Исполнителю уведомление об одностороннем отказе в исполнении оферты с адреса электронной почты, указанной им при регистрации на Сайте. Оферта считается расторгнутой с момента получения Исполнителем уведомления Заказчика об одностороннем отказе от исполнения оферты.</p>

          <p><strong>6.3.2.</strong> возместить Исполнителю фактически понесенные расходы, связанные с оказанием Услуги по оферте, в том числе:</p>
          <p><strong>6.3.2.1.</strong> расходы Исполнителя и расходы на оплату услуг третьих лиц;</p>
          <p><strong>6.3.2.2.</strong> комиссии банковских, кредитных организаций и соответствующих платежных систем за осуществление возврата денежных средств;</p>
          <p><strong>6.3.2.3.</strong> иные расходы, понесенные Исполнителем в процессе оказания Услуги по оферте. Конкретная сумма фактических расходов определяется Исполнителем самостоятельно.</p>

          <p><strong>6.3.3.</strong> оплатить стоимость оказанных услуг на момент расторжения оферты.</p>

          <p><strong>6.4.</strong> Рассмотрение заявления Заказчика о расторжении оферты и/или возврате денежных средств производится в течение 20 банковских дней со дня получения Исполнителем соответствующего письменного заявления Заказчика.</p>

          <p><strong>6.5.</strong> Оферта может быть расторгнута по инициативе Исполнителя в случаях нарушения Заказчиком (достаточно разового нарушения) принятых на себя обязательств по оферте.</p>
          <p>Расторжение оферты в этом случае происходит посредством уведомления Заказчика электронным сообщением на адрес электронной почты, указанной им при регистрации на Сайте. Денежные средства, уплаченные Исполнителю, возврату не подлежат и удерживаются Исполнителем в качестве штрафа за ненадлежащее исполнение условий оферты. Оферта считается расторгнутой с момента направления Исполнителем соответствующего уведомления Заказчику.</p>

          <p><strong>6.6.</strong> В момент досрочного расторжения оферты доступ к обучению, ее блокам, и любым другим материалам, предоставленным Исполнителем Заказчику в процессе исполнения оферта, прекращается с момента прекращения действия договорных отношений между Сторонами.</p>

          <p><strong>6.7.</strong> В случае расторжения договора оферты, Заказчик обязан предоставить Исполнителю соответствующее заявление с указанием банковских реквизитов, на которые стоит осуществить возврат денежных средств.</p>
          <p>В противном случае, Исполнитель вправе не производить перечисление денежных средств до момента предоставления надлежащих банковских реквизитов. На период непредоставления надлежащих банковских реквизитов неустойка на сумму возврата не начисляется.</p>

          <h2>7. КОНФИДЕНЦИАЛЬНОСТЬ</h2>
          <p><strong>7.1.</strong> Стороны считают конфиденциальной информацию, передаваемую ими друг другу в связи с реализацией Услуги, подлежащую защите в соответствии с законодательством РФ.</p>

          <p><strong>7.2.</strong> Заказчик и Исполнитель обязуются принимать разумно достаточные меры по охране конфиденциальной информации, полученной в рамках реализации Услуги, которые исключают доступ к конфиденциальной информации третьих лиц, а также от иных неправомерных действий в отношении такой конфиденциальной информации.</p>

          <p><strong>7.3.</strong> Стороны не должны передавать полученную конфиденциальную информацию третьим лицам без согласия ее обладателя, за исключением случаев, когда:</p>
          <ul>
            <li>это необходимо для надлежащего выполнения их обязательств,</li>
            <li>такая информация является общедоступной,</li>
            <li>информация передается по взаимному согласованию Сторон,</li>
            <li>информация подлежит раскрытию по запросу правоохранительных органов и органов исполнительной власти на основании действующего законодательства Российской Федерации;</li>
            <li>информация передается консультантам, аудиторам, иным третьим лицам Исполнителя при соблюдении действующего законодательства Российской Федерации.</li>
          </ul>

          <h2>8. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ И СРОК ДЕЙСТВИЯ ОФЕРТЫ</h2>
          <ol>
            <li>В случае опоздания на занятия более 15 минут Исполнитель имеет право не допустить на занятие, которое списывается с абонемента и не переносится.</li>
            <li>Для занятий необходимо иметь: полотенце, купальник/плавки, шапочка, очки.</li>
            <li>За 45 минут до тренировки не желательно принимать пищу.</li>
            <li>Исполнитель, либо привлеченные субагенты имеет право удалить Заказчика, либо его несовершеннолетнего ребенка с тренировки за несоблюдение дисциплины.</li>
            <li>Исполнитель не несет ответственность за ценные вещи, оставленные без присмотра.</li>
            <li>Приходить на тренировку необходимо за 10-15 минут до начала занятия, для того чтоб успеть переодеться и подготовиться к плаванию.</li>
            <li>Оферта действует с даты акцепта оферты Заказчиком до даты исполнения обязательств, принятых на себя по оферте Сторонами.</li>
          </ol>

          <h2>9. ПЕРСОНАЛЬНЫЕ ДАННЫЕ</h2>
          <p><strong>9.1.</strong> Заказчик добровольно предоставляет Исполнителю свои персональные данные (далее -- «ПД»):</p>
          <ul>
            <li>фамилию, имя, отчество;</li>
            <li>адрес электронной почты,</li>
            <li>дату, место рождения;</li>
            <li>паспортные данные;</li>
            <li>контактный номер телефона;</li>
            <li>фото и/или видеоизображение Заказчика и иные, предусмотренные Политикой в отношении обработки персональных данных, действующей у Исполнителя.</li>
          </ul>
          <p>ПД Заказчика обрабатываются в соответствии с Федеральным законом № 152-ФЗ от 27.07.2006 г. «О персональных данных».</p>

          <p><strong>9.2.</strong> Исполнитель имеет право осуществлять обработку персональных данных Заказчика, включая:</p>
          <ul>
            <li>Сбор</li>
            <li>Хранение</li>
            <li>Систематизацию</li>
            <li>Использование</li>
            <li>Распространение</li>
            <li>Накопление</li>
            <li>Хранение</li>
            <li>Уточнение (обновление, изменение)</li>
            <li>Уничтожение ПД.</li>
          </ul>

          <p><strong>9.3.</strong> Предоставляя свои ПД Исполнителю, Заказчик соглашается на их обработку Исполнителем, в том числе в целях:</p>
          <ul>
            <li>выполнения Исполнителем обязательств перед Заказчиком в рамках оферты,</li>
            <li>продвижения Исполнителем своих товаров и услуг,</li>
            <li>проведения электронных и смс-опросов,</li>
            <li>контроля результатов маркетинговых акций,</li>
            <li>клиентской поддержки,</li>
            <li>контроля удовлетворенности Заказчика, а также качества Услуги, оказываемых Исполнителем.</li>
          </ul>

          <p><strong>9.4.</strong> Оставляя Исполнителю отзывы (в любой форме), Заказчик дает согласие на использование Исполнителем этих отзывов с целью продвижения и рекламы своих услуг.</p>

          <p><strong>9.5.</strong> ПД Заказчика передаются в электронной форме по открытым каналам связи сети интернет.</p>

          <p><strong>9.6.</strong> ПД Заказчика могут быть переданы третьим лицам для реализации целей, указанных в оферте.</p>

          <p><strong>9.7.</strong> Принимая участие в специальных групповых чатах, создаваемых Исполнителем в мессенджерах Ватсап, Телеграм, иных с целью оказания Услуги по оферте, Заказчик обязуется не разглашать, не распространять, не копировать персональные данные иных участников таких чатов.</p>

          <p><strong>9.8.</strong> Заказчику запрещается производить рассылку любой информации, направлять коммерческие или маркетинговые предложения, иным образом использовать список и контакты участников специальных групповых чатов без предварительного согласования с Исполнителем.</p>

          <h2>10. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
          <p><strong>10.1.</strong> Заказчик дает согласие на обработку, хранение Исполнителем персональных данных Заказчика по правилам Политики в отношении обработки персональной информации</p>

          <p><strong>10.2.</strong> Обучение и ее составные части, блоки, составные части являются объектами авторского права. Информация, к которой Заказчик получает доступ, а также передаваемая и/или высылаемая Заказчику в рамках оказываемых Исполнителем Услуги, предназначена только Заказчику и обучаемому лицу, носит конфиденциальный характер и защищена положениями действующего законодательства об авторском праве и не может копироваться, передаваться третьим лицам, тиражироваться, распространяться, пересылаться, публиковаться в электронной, "бумажной" или иной форме без дополнительных соглашений или официального письменного согласия Исполнителя. В случае выявления Исполнителем нарушения его авторских прав со стороны Заказчика, Исполнитель вправе требовать оплаты штрафа с Заказчика в размере 250000 рублей в течении 30 (тридцати) календарных дней с момента получения от Исполнителя письменного уведомления.</p>

          <p><strong>10.3.</strong> Электронный документооборот по адресам электронной почты, указанной Исполнителем в настоящем Договоре-оферте, указанном Заказчиком в Заявке на регистрацию приравнивается Сторонами к документообороту на бумажных носителях, в том числе при направлении претензий и (или) ответов на претензии.</p>

          <p><strong>10.4.</strong> По всем вопросам, не урегулированным настоящим Договором, Стороны руководствуются действующим законодательством Российской Федерации.</p>

          <h2>11. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ</h2>
          <div className="requisites">
            <p>Беляева Мария Геннадьевна</p>
            <p>11 декабря 1982 года рождения</p>
            <p>Уроженка г. Казани</p>
            <p>Адрес: г. Казань, ул. А. Козина, дом 2, квартира 753.</p>
            <p>ИНН 165702626938, зарегистрирована в качестве самозанятого</p>
            <p>Тел. 89178555388.</p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Agreement;