import React from 'react';
import ReviewsCard from '../card/ReviewCard';
import '../../styles/review.css';
import useInView from '../../hooks/useInView';

const ReviewsPage = () => {
  const [ref, isInView] = useInView({
    threshold: 0.1,
    rootMargin: '0px 0px -20px 0px'
  });
  return (
    <div className="reviews-container" ref={ref}>
      <h1 className={`main-title ${isInView ? 'animate' : ''}`}>ОТЗЫВЫ</h1>
      <div className={`reviews-content ${isInView ? 'animate' : ''}`}>
        <ReviewsCard 
          name='Гузель Сиреньевна'
          date='14.08.2025'
          rating="5"
          text={
            <>
              Это лучшая школа плаванья!
              Не надо тратить время на поиски!
              Смело сюда!
              Во-первых, все тренеры высокообразованные специалисты с высшим профильным образованием. Мастера и кандидаты в мастера смюпорта!
              Во-вторых. Научить плавать ребенка задача нелегкая но самая распространенная.
              А научить 50 летнюю даму с зажатыми мышцами, слабой спиной и ногами - задачка по труднее!
              Я - та самая дама, которую Мария, Ирина и Кирилл превратили из пешехода в сильную брассистку и смелую кролистку!
              Если обучаться - то только о с ними, у них, и здесь!
            </>
          }
          isVisible={isInView}
          delay={0}
        />
        <ReviewsCard 
          name='Аида Галиева'
          date='15.08.2025'
          rating="5"
          text='Мария Геннадьевна научила мою дочь хорошо плавать всего за 10 дней, я даже не поверила, так как до этого она ходила в другие бассейны, где совсем не было результата. Занятия проходят очень интересно, бывают праздники, конкурсы и подарки. Мария Геннадьевна лучший тренер, дети ее очень любят!!'
          isVisible={isInView}
          delay={100}
        />
        <ReviewsCard 
          name='Анастасия Лаврентьева'
          date='15.08.2025'
          rating="5"
          text='Мечта - поступить в обычную школу плавания в 7 лет не осуществилась по причине частых простуд. В 10 лет, когда мы узнали про школу плавания Mariaswimpro, не задумываясь отдали сына. Лучший тренерский состав: Ирина Анатольевна, Кирилл Константинович и наш любимый тренер Мария Геннадьевна - тренеры от Бога! Сын еле держался на воде, когда пришёл в октябре. А к маю у него уже был второй юношеский разряд! Теперь плавание - это любовь навсегда!'
          isVisible={isInView}
          delay={200}
        />
        <ReviewsCard 
          name='Лиля Веселова'
          date='19.07.2025'
          rating="5"
          text='Доброго дня . Огромная благодарность «Школе плавания» Mariaswimpro и Тренерам . Дочь в восторге и обожает Ваши тренировки . Здоровье поправилось , мышцы окрепли и хотим и будем продолжать заниматься . Индивидуальный подход к каждому человеку как в групповых так и в индивидуальных занятиях . Все тренировки проходят весело , задорно и комфортно. Желаю Вашей команде процветания !!! Спасибо'
          isVisible={isInView}
          delay={300}
        />
        <ReviewsCard 
          name='Наиля Петрова'
          date='22.08.2025'
          rating="5"
          text='Мария Геннадьевна- отличный тренер, профессионал в сфере водных видов спорта и ОФП! Умеет найти подход к детям любого возраста, прекрасно ставит технику плавания всех стилей. Чувствуется заинтересованнасть в детях. Оба старших детей занимались плаваньем у Марии Геннадьевны, а теперь привели к ней и младшего сына. Уже после первого занятия, сын научился держаться на воде, нырять и быстро освоился в воде. Своего тренера очень непросто найти, со старшими детьми мы сменили несколько тренеров, предже чем попали к Марии Геннадьевне. Очень ценим нашего тренера!'
          isVisible={isInView}
          delay={400}
        />
        <ReviewsCard 
          name='Айтан Бабаева'
          date='14.08.2025'
          rating="5"
          text={
            <>
              Мария Геннадьевна-профессионал в своём деле очень рада, что познакомилась с таким человеком 🤍 <br />
              Хочу отметить, что Мария Геннадьевна очень пунктуальная, ответственная и обязательный человек для меня это важно🙏
            </>
          }
          isVisible={isInView}
          delay={500}
        />
      </div>
    </div>
  );
};

export default ReviewsPage;