import React from 'react';
import '../../styles/legal.css'

const PolitikaKonfidencialnosti = () => {
  return (
    <div className="legal-page">
      <div className="legal-container">
        <h1>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h1>
        <h2>Беляевой Марии Геннадьевны, зарегистрированной в качестве самозанятого</h2>
        
        {/* <div className="legal-header">
          <table>
            <tbody>
              <tr>
                <td className='left'><strong>Номер</strong></td>
                <td>[ ]</td>
              </tr>
              <tr>
                <td className='left'><strong>Дата составления</strong></td>
                <td>[ ]</td>
              </tr>
            </tbody>
          </table>
        </div> */}

        <div className="legal-content">
          <h2>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h2>
          <p><strong>1.1.</strong> Существующая на текущий момент политика конфиденциальности персональных данных (далее -- Политика конфиденциальности) работает со следующими понятиями:</p>

          <p><strong>а)</strong> «Администрация Сайта (далее -- Администрация сайта)». Так называют представляющих интересы организации специалистов, в чьи обязанности входит управление сайтом, то есть организация и (или) обработка поступивших на него персональных данных. Для выполнения этих обязанностей они должны чётко представлять, для чего обрабатываются сведения, какие сведения должна быть обработаны, какие действия (операции) должны производиться с полученными сведениями.</p>

          <p><strong>б)</strong> «Персональные данные» --- сведения, имеющие прямое или косвенное отношение к определённому либо определяемому физическому лицу (также называемому субъектом персональных данных).</p>

          <p><strong>в)</strong> «Обработка персональных данных» --- любая операция (действие) либо совокупность таковых, которые Администрация производит с персональными данными. Их могут собирать, записывать, систематизировать, накапливать, хранить, уточнять (при необходимости обновлять или изменять), извлекать, использовать, передавать (распространять, предоставлять, открывать к ним доступ), обезличивать, блокировать, удалять и даже уничтожать. Данные операции (действия) могут выполняться как автоматически, так и вручную.</p>

          <p><strong>г)</strong> «Конфиденциальность персональных данных» --- обязательное требование, предъявляемое к Оператору или иному работающему с данными Пользователя должностному лицу, хранить полученные сведения в тайне, не посвящая в них посторонних, если предоставивший персональные данные Пользователь не изъявил своё согласие, а также отсутствует законное основание для разглашения.</p>

          <p><strong>д)</strong> «Пользователь Сайта» (далее --- Пользователь)» -- человек, посетивший Сайт, а также пользующийся его программы и продуктами.</p>

          <p><strong>е)</strong> «Cookies» --- короткий фрагмент данных, пересылаемый веб-браузером или веб-клиентом веб-серверу в http-запросе, всякий раз, когда Пользователь пытается открыть страницу Сайта. Фрагмент хранится на компьютере Пользователя.</p>

          <p><strong>ж)</strong> «IP-адрес» --- уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу TCP/IP.</p>

          <h2>2. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
          <p><strong>2.1.</strong> Просмотр Сайта, а также использование его программ и продуктов подразумевают автоматическое согласие с принятой там Политикой конфиденциальности, подразумевающей предоставление Пользователем персональных данных на обработку.</p>

          <p><strong>2.2.</strong> Если Пользователь не принимает существующую Политику конфиденциальности, Пользователь должен покинуть Сайт.</p>

          <p><strong>2.3.</strong> Имеющаяся Политика конфиденциальности распространяется только на Сайт. Если по ссылкам, размещённым на сайте последнего, Пользователь зайдёт на ресурсы третьих лиц, Сайт за его действия ответственности не несёт.</p>

          <p><strong>2.4.</strong> Проверка достоверности персональных данных, которые решил сообщить принявший Политику конфиденциальности Пользователь, не входит в обязанности Администрации сайта.</p>

          <h2>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h2>
          <p><strong>3.1.</strong> Согласно проводимой в текущий период Политике конфиденциальности Администрация Сайта обязана не разглашать персональные данные, сообщаемые Пользователями, регистрирующимися на сайте, записывающимися на тренировки/занятия по плаванию, оформляющими заказ на приобретение абонемента на групповые, индивидуальные/персональные занятия по плаванию, либо на пробную тренировку/занятие, а также обеспечивать этим данным абсолютную конфиденциальность.</p>

          <p><strong>3.2.</strong> Чтобы сообщить персональные данные, Пользователь заполняет расположенные на Сайте электронные формы. Персональными данными Пользователя, которые подлежат обработке, являются:</p>
          <p><strong>а)</strong> его фамилия, имя, отчество;</p>
          <p><strong>б)</strong> его контактный телефон;</p>
          <p><strong>в)</strong> его электронный адрес (e-mail);</p>

          <p><strong>3.3.</strong> Защита данных, автоматически передаваемых при просмотре рекламных блоков и посещении страниц с установленными на них статистическими скриптами системы (пикселями) осуществляется Сайтом. Вот перечень этих данных:</p>
          <p><strong>а)</strong> IP-адрес;</p>
          <p><strong>б)</strong> сведения из cookies;</p>
          <p><strong>в)</strong> сведения о браузере (либо другой программе, через которую становится доступен показ рекламы);</p>
          <p><strong>г)</strong> время посещения сайта;</p>
          <p><strong>д)</strong> адрес страницы, на которой располагается рекламный блок;</p>
          <p><strong>е)</strong> реферер (адрес предыдущей страницы).</p>

          <p><strong>3.4.</strong> Последствием отключения cookies может стать невозможность доступа к требующим авторизации частям Сайта.</p>

          <p><strong>3.5.</strong> Сайт собирает статистику об IP-адресах всех посетителей. Данные сведения нужны, чтобы выявить и решить технические проблемы и проконтролировать, насколько законным будет проведение финансовых платежей.</p>

          <p><strong>3.6.</strong> Любые другие неоговорённые выше персональные сведения (о том, когда и какие покупки были сделаны, какой при этом использовался браузер, какая была установлена операционная система и пр.) надёжно хранятся и не распространяются. Исключение существующая Политика конфиденциальности предусматривает для случаев, описанных в п.п. 5.2 и 5.3.</p>

          <p><strong>3.7.</strong> Если субъектом персональных данных является несовершеннолетний, обработка его персональных данных осуществляется только с письменного согласия законного представителя (родителя или опекуна).</p>

          <p><strong>3.8.</strong> Оператор не обрабатывает специальные категории персональных данных (о расовой или национальной принадлежности, политических взглядах, религиозных или философских убеждениях, здоровье, интимной жизни), а также биометрические персональные данные.</p>

          <h2>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</h2>
          <p><strong>4.1.</strong> Сбор персональных данных Пользователя Администрацией Сайта проводится ради того, чтобы:</p>

          <p><strong>а)</strong> Идентифицировать Пользователя, который прошёл процедуру регистрации на Сайте, чтобы записать Пользователя на тренировки/занятия по плаванию, в том числе групповые, индивидуальные/персональные тренировки/занятия по плаванию, пробные тренировки/занятия., либо оформить заказ на приобретение абонемента на групповые, индивидуальные/персональные занятия по плаванию, либо на пробную тренировку/занятие.</p>

          <p><strong>б)</strong> Открыть Пользователю доступ к персонализированным ресурсам данного сайта.</p>

          <p><strong>в)</strong> Установить с Пользователем обратную связь, под которой подразумевается, в частности, рассылка запросов и уведомлений, касающихся использования Сайта, обработка пользовательских запросов и заявок, оказание прочих услуг.</p>

          <p><strong>г)</strong> Создать учётную запись для совершения записи Пользователя на тренировки/занятия по плаванию, в том числе групповые, индивидуальные/персональные тренировки/занятия по плаванию, пробные тренировки/занятия, либо оформления заказа на приобретение абонемента на групповые, индивидуальные/персональные занятия по плаванию, либо на пробную тренировку/занятие, если Пользователь изъявил на то своё желание.</p>

          <p><strong>д)</strong> Уведомить Пользователя об его записи на тренировки или состоянии его заказа на приобретение абонемента на тренировки/занятия, либо согласования дата и времени приобретения абонемента на тренировки.</p>

          <p><strong>ж)</strong> Обеспечить Пользователю максимально быстрое решение проблем, встречающихся при использовании Сайта, за счёт эффективной клиентской и технической поддержки.</p>

          <p><strong>з)</strong> Своевременно ознакомлять Пользователя с уникальными предложениями, новыми прайсами, новостей о деятельности Сайта или его партнёров и прочими сведениями, если Пользователь изъявит на то своё согласие.</p>

          <p><strong>и)</strong> Предоставить Пользователю доступ на сайты или сервисы Сайта, помогая ему тем самым получать обновления и услуги.</p>

          <h2>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h2>
          <p><strong>5.1.</strong> Срок обработки персональных данных Пользователя ничем не ограничен. Процедура обработки может проводиться любым предусмотренным законодательством способом. В частности, с помощью информационных систем персональных данных, которые могут вестись автоматически либо без средств автоматизации.</p>

          <p><strong>5.2.</strong> Обработанные Администрацией сайта персональные данные Пользователя могут передаваться третьим лицам, в числе которых операторы электросвязи. Делается это для того, чтобы уточнить время записи на тренировки/занятия по плаванию, в том числе групповые, индивидуальные/персональные тренировки/занятия по плаванию, пробные тренировки/занятия, а также согласовать с Пользователем приобретение абонемента на групповые, индивидуальные/персональные занятия по плаванию, либо на пробную тренировку/занятие. Согласие Пользователя на подобную передачу предусмотрено правилами политики сайта.</p>

          <p><strong>5.3.</strong> Также обработанные Администрацией сайта персональные данные могут передаваться уполномоченным органов государственной власти Российской Федерации, если это осуществляется на законных основаниях и в предусмотренном российским законодательством порядке.</p>

          <p><strong>5.4.</strong> Если персональные данные будут утрачены или разглашены, Пользователь уведомляется об этом Администрацией сайта.</p>

          <p><strong>5.5.</strong> Все действия Администрации сайта направлены на то, чтобы не допустить к персональным данным Пользователя третьих лиц (за исключением п.п. 5.2, 5.3). Последним эта информация не должна быть доступна даже случайно, дабы те не уничтожили её, не изменили и не блокировали, не копировали и не распространяли, а также не совершали прочие противозаконные действия. Для защити пользовательских данных Администрация располагает комплексом организационных и технических мер.</p>

          <p><strong>5.6.</strong> Если персональные данные будут утрачены либо разглашены, Администрация сайта совместно с Пользователем готова принять все возможные меры, дабы предотвратить убытки и прочие негативные последствия, вызванные данной ситуацией.</p>

          <h2>6. ОБЯЗАТЕЛЬСТВА СТОРОН</h2>
          <p><strong>6.1.</strong> В обязанности Пользователя входит:</p>
          <p><strong>а)</strong> Сообщение соответствующих требованиям Сайта сведений о себе.</p>
          <p><strong>б)</strong> Обновление и дополнение предоставляемых им сведений в случае изменения таковых.</p>

          <p><strong>6.2.</strong> В обязанности Администрации сайта входит:</p>
          <p><strong>а)</strong> Применение полученных сведений исключительно в целях, обозначенных в п. 4 существующей Политики конфиденциальности.</p>
          <p><strong>б)</strong> Обеспечение конфиденциальности поступивших от Пользователя сведений. Они не должны разглашаться, если Пользователь не даст на то письменное разрешение. Также Администрация не имеет права продавать, обменивать, публиковать либо разглашать прочими способами переданные Пользователем персональные данные, исключая п.п. 5.2 и 5.3 существующей Политики конфиденциальности.</p>
          <p><strong>в)</strong> Принятие мер предосторожности, дабы персональные данные Пользователя оставались строго конфиденциальными, точно также, как остаются конфиденциальными такого рода сведения в современном деловом обороте.</p>
          <p><strong>г)</strong> Блокировка персональных пользовательских данных с того момента, с которого Пользователь либо его законный представитель сделает соответствующий запрос. Право сделать запрос на блокировку также предоставляется органу, уполномоченному защищать права Пользователя, предоставившего Администрации сайта свои данные, на период проверки, в случае обнаружения недостоверности сообщённых персональных данных либо неправомерности действий.</p>

          <h2>7. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
          <p><strong>7.1.</strong> В случае неисполнения Администрацией сайта собственных обязательств и, как следствие, убытков Пользователя, понесённых из-за неправомерного использования предоставленной им информации, ответственность возлагается на неё. Об этом, в частности, утверждает российское законодательство. Исключение существующая в настоящее время Политика конфиденциальности делает для случаев, отражённых в п.п. 5.2, 5.3 и 7.2.</p>

          <p><strong>7.2.</strong> Но существует ряд случаев, когда Администрация сайта ответственности не несёт, если пользовательские данные утрачиваются или разглашаются. Это происходит тогда, когда они:</p>
          <p><strong>а)</strong> Превратились в достояние общественности до того, как были утрачены или разглашены.</p>
          <p><strong>б)</strong> Были предоставлены третьими лицами до того, как их получила Администрация сайта.</p>
          <p><strong>в)</strong> Разглашались с согласия Пользователя.</p>

          <h2>8. РАЗРЕШЕНИЕ СПОРОВ</h2>
          <p><strong>8.1.</strong> Если Пользователь недоволен действиями Администрации Сайта и намерен отстаивать свои права в суде, до того, как обратиться с иском, он в обязательном порядке должен предъявить претензию (письменно предложить урегулировать конфликт добровольно).</p>

          <p><strong>8.2.</strong> Получившая претензию Администрация обязана в течение 30 календарных дней с даты её получения письменно уведомить Пользователя о её рассмотрении и принятых мерах.</p>

          <p><strong>8.3.</strong> Если обе стороны так и не смогли договориться, спор передаётся в судебный орган, где его должны рассмотреть согласно действующему российскому законодательству.</p>

          <p><strong>8.4.</strong> Регулирование отношений Пользователя и Администрации сайта в Политике конфиденциальности проводится согласно действующему российскому законодательству.</p>

          <h2>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
          <p><strong>9.1.</strong> Администрация сайта вправе менять существующую на текущий момент Политику конфиденциальности, не спрашивая согласия у Пользователя.</p>

          <p><strong>9.2.</strong> Вступление в силу новой Политики конфиденциальности начинается после того, как информация о ней будет выложена на Сайт, если изменившаяся Политика не подразумевает иного варианта размещения.</p>

          <p><strong>9.3.</strong> Все предложения, пожелания, требования или вопросы по настоящей Политике конфиденциальности следует сообщать путем отправки электронного письма по адресу mariaswimpro@gmail.com.</p>

          <p><strong>9.4.</strong> Прочитать о существующей Политике конфиденциальности можно, зайдя на страницу по адресу: <a href="https://www.mariaswimpro.ru">https://www.mariaswimpro.ru</a>.</p>
        </div>
      </div>
    </div>
  );
};

export default PolitikaKonfidencialnosti;